zephyrproject-rtos/zephyr/drivers/usb/uhc/uhc_dwc2_stm32u5_hsotg.h
/*
 * SPDX-FileCopyrightText: Copyright The Zephyr Project Contributors
 *
 * SPDX-License-Identifier: Apache-2.0
 */

#ifndef ZEPHYR_DRIVERS_USB_UHC_DWC2_STM32U5_HSOTG_H
#define ZEPHYR_DRIVERS_USB_UHC_DWC2_STM32U5_HSOTG_H

#include <zephyr/kernel.h>
#include <zephyr/sys/sys_io.h>
#include <zephyr/drivers/gpio.h>
#include <zephyr/drivers/pinctrl.h>
#include <zephyr/drivers/clock_control.h>
#include <zephyr/drivers/clock_control/stm32_clock_control.h>

#include <usb_dwc2_hw.h>

/* HAL SYSCFG for the embedded HS PHY, LL PWR for the USB power supply */
#include <soc.h>
#include <stm32_ll_pwr.h>

/* STM32U5 OTG_HS host quirk configuration */
struct uhc_dwc2_stm32u5_config {
	const struct device *clk_dev;
	const struct stm32_pclken *pclken;
	const struct stm32_pclken *phy_pclken;
	size_t phy_pclken_len;
	uint32_t phy_ref_clk;
	const struct pinctrl_dev_config *pcfg;
	/* External VBUS power-switch enable, optional */
	struct gpio_dt_spec vbus_gpio;
	bool force_vbus_valid;
};

struct uhc_dwc2_stm32u5_data {
	uint32_t reserved;
};

#define UHC_DWC2_STM32U5_SESSION_VALID_OVERRIDE					\
	(USB_DWC2_GOTGCTL_AVALOEN | USB_DWC2_GOTGCTL_AVALOVAL |		\
	 USB_DWC2_GOTGCTL_BVALOEN | USB_DWC2_GOTGCTL_BVALOVAL)

static inline struct usb_dwc2_reg *uhc_dwc2_stm32u5_base(const struct device *const dev)
{
	const struct uhc_dwc2_config *const config = dev->config;

	return config->base;
}

static inline int uhc_dwc2_stm32u5_enable_clk(const struct uhc_dwc2_stm32u5_config *const cfg)
{
	if (!device_is_ready(cfg->clk_dev)) {
		return -ENODEV;
	}

	return clock_control_on(cfg->clk_dev, (void *)&cfg->pclken[0]);
}

/* Enable the USB power supply (mirrors the STM32U5 path in stm32_usb_pwr_enable()) */
static inline int uhc_dwc2_stm32u5_enable_pwr(void)
{
	if (LL_PWR_GetRegulVoltageScaling() < LL_PWR_REGU_VOLTAGE_SCALE2) {
		LOG_ERR("Wrong power range to use USB OTG_HS");
		return -EIO;
	}

	LL_PWR_EnableVddUSB();
	LL_PWR_EnableUSBPowerSupply();
	LL_PWR_EnableUSBEPODBooster();
	while (LL_PWR_IsActiveFlag_USBBOOST() != 1) {
		/* Wait for the USB EPOD booster to be ready */
	}

	return 0;
}

/*
 * Bring up the embedded High-Speed PHY
 * (mirrors the drivers/usb/common/stm32/phy_u5otghs.c sequence)
 */
static inline int uhc_dwc2_stm32u5_enable_phy(const struct device *const dev)
{
	const struct uhc_dwc2_stm32u5_config *const cfg = UHC_DWC2_QUIRK_CONFIG(dev);
	int ret;

	/* SYSCFG holds the OTG_HS PHY configuration registers */
	__HAL_RCC_SYSCFG_CLK_ENABLE();

	/* Select the PHY reference clock frequency */
	HAL_SYSCFG_SetOTGPHYReferenceClockSelection(cfg->phy_ref_clk);

	/* Deassert the PHY reset */
	HAL_SYSCFG_EnableOTGPHY(SYSCFG_OTG_HS_PHY_ENABLE);

	if (cfg->phy_pclken_len > 1) {
		/* Select the PHY kernel clock source */
		ret = clock_control_configure(cfg->clk_dev, (void *)&cfg->phy_pclken[1], NULL);
		if (ret) {
			return ret;
		}
	}

	/* Turn on the PHY clock */
	return clock_control_on(cfg->clk_dev, (void *)&cfg->phy_pclken[0]);
}

static inline void uhc_dwc2_stm32u5_disable_phy(const struct device *const dev)
{
	const struct uhc_dwc2_stm32u5_config *const cfg = UHC_DWC2_QUIRK_CONFIG(dev);

	(void)clock_control_off(cfg->clk_dev, (void *)&cfg->phy_pclken[0]);
}

static inline void uhc_dwc2_stm32u5_disable_clk(const struct device *const dev)
{
	const struct uhc_dwc2_stm32u5_config *const cfg = UHC_DWC2_QUIRK_CONFIG(dev);

	(void)clock_control_off(cfg->clk_dev, (void *)&cfg->pclken[0]);
}

static inline void uhc_dwc2_stm32u5_disable_pwr(void)
{
	LL_PWR_DisableUSBEPODBooster();
	while (LL_PWR_IsActiveFlag_USBBOOST() != 0) {
		/* Wait for the USB EPOD booster to turn off */
	}

	LL_PWR_DisableUSBPowerSupply();
	LL_PWR_DisableVddUSB();
}

/*
 * Enable the USB power supply, the OTG_HS clock and bring up the high-speed PHY.
 * The DWC2 core soft reset, dwc2_core_soft_reset(), performed later in
 * uhc_dwc2_init() only completes with a running PHY clock, so the PHY must be
 * clocked here first.
 */
static inline int uhc_dwc2_stm32u5_pre_init(const struct device *const dev)
{
	const struct uhc_dwc2_stm32u5_config *const cfg = UHC_DWC2_QUIRK_CONFIG(dev);
	int ret;

	ret = uhc_dwc2_stm32u5_enable_pwr();
	if (ret) {
		return ret;
	}

	ret = uhc_dwc2_stm32u5_enable_clk(cfg);
	if (ret) {
		return ret;
	}

	if (cfg->pcfg != NULL) {
		ret = pinctrl_apply_state(cfg->pcfg, PINCTRL_STATE_DEFAULT);
		if (ret < 0) {
			return ret;
		}
	}

	return uhc_dwc2_stm32u5_enable_phy(dev);
}

static inline int uhc_dwc2_stm32u5_shutdown(const struct device *const dev)
{
	uhc_dwc2_stm32u5_disable_phy(dev);
	uhc_dwc2_stm32u5_disable_clk(dev);
	uhc_dwc2_stm32u5_disable_pwr();

	return 0;
}

static inline void uhc_dwc2_stm32u5_configure_vbus(const struct device *const dev)
{
	const struct uhc_dwc2_stm32u5_config *const cfg = UHC_DWC2_QUIRK_CONFIG(dev);
	struct usb_dwc2_reg *const base = uhc_dwc2_stm32u5_base(dev);
	const mem_addr_t gotgctl = (mem_addr_t)&base->gotgctl;
	const mem_addr_t ggpio = (mem_addr_t)&base->ggpio;

	/* Device-mode VBUS overrides do not apply to the host configuration. */
	sys_clear_bits(ggpio, USB_OTG_GCCFG_VBVALEXTOEN | USB_OTG_GCCFG_VBVALOVAL);

	if (cfg->force_vbus_valid) {
		/*
		 * Keep the U5 VBUS detector enabled to preserve the PHY state used by
		 * working boards, but override the DWC2 session-valid inputs when the
		 * board cannot provide a usable VBUS indication.
		 */
		sys_set_bits(ggpio, USB_OTG_GCCFG_VBDEN);
		sys_set_bits(gotgctl, UHC_DWC2_STM32U5_SESSION_VALID_OVERRIDE);
	} else {
		sys_clear_bits(ggpio, USB_OTG_GCCFG_VBDEN);
		sys_clear_bits(gotgctl, UHC_DWC2_STM32U5_SESSION_VALID_OVERRIDE);
	}
}

/* Enable the PHY pulldown resistors and configure host-session validity. */
static inline int uhc_dwc2_stm32u5_pre_enable(const struct device *const dev)
{
	const mem_addr_t ggpio = (mem_addr_t)&uhc_dwc2_stm32u5_base(dev)->ggpio;

	sys_set_bits(ggpio, USB_OTG_GCCFG_PULLDOWNEN);
	uhc_dwc2_stm32u5_configure_vbus(dev);

	return 0;
}

static inline int uhc_dwc2_stm32u5_post_enable(const struct device *const dev)
{
	const struct uhc_dwc2_stm32u5_config *const cfg = UHC_DWC2_QUIRK_CONFIG(dev);

	if (cfg->vbus_gpio.port == NULL) {
		return 0;
	}

	if (!gpio_is_ready_dt(&cfg->vbus_gpio)) {
		LOG_ERR("VBUS enable GPIO not ready");
		return -ENODEV;
	}

	return gpio_pin_configure_dt(&cfg->vbus_gpio, GPIO_OUTPUT_ACTIVE);
}

static inline int uhc_dwc2_stm32u5_disable(const struct device *const dev)
{
	const struct uhc_dwc2_stm32u5_config *const cfg = UHC_DWC2_QUIRK_CONFIG(dev);
	struct usb_dwc2_reg *const base = uhc_dwc2_stm32u5_base(dev);

	if (cfg->vbus_gpio.port != NULL) {
		(void)gpio_pin_set_dt(&cfg->vbus_gpio, 0);
	}
	if (cfg->force_vbus_valid) {
		sys_clear_bits((mem_addr_t)&base->gotgctl,
			       UHC_DWC2_STM32U5_SESSION_VALID_OVERRIDE);
	}

	return 0;
}

/*
 * The PHY node holds the reference clock selection and the PHY clocks. The
 * SYSCFG_OTG_HS_PHY_CLK_SELECT_<n> values go from 1 to N, whereas DT_ENUM_IDX()
 * is zero-based, hence the UTIL_INC().
 */
#define UHC_DWC2_STM32U5_PHY_NODE(n)	DT_INST_PHANDLE(n, phys)

#define UHC_DWC2_STM32U5_PHY_REF_CLK(n)							\
	CONCAT(SYSCFG_OTG_HS_PHY_CLK_SELECT_,						\
	       UTIL_INC(DT_ENUM_IDX(UHC_DWC2_STM32U5_PHY_NODE(n), clock_reference)))

#define UHC_DWC2_STM32U5_PCFG(n)							\
	COND_CODE_1(DT_INST_NODE_HAS_PROP(n, pinctrl_0),				\
		    (PINCTRL_DT_INST_DEV_CONFIG_GET(n)), (NULL))

#define QUIRK_STM32U5_HSOTG_DEFINE(n)							\
	COND_CODE_1(DT_INST_NODE_HAS_PROP(n, pinctrl_0),				\
		    (PINCTRL_DT_INST_DEFINE(n);), ())					\
	static const struct stm32_pclken pclken_##n[] = STM32_DT_INST_CLOCKS(n);	\
	static const struct stm32_pclken phy_pclken_##n[] =				\
		STM32_DT_CLOCKS(UHC_DWC2_STM32U5_PHY_NODE(n));				\
											\
	static const struct uhc_dwc2_stm32u5_config uhc_dwc2_quirk_config_##n = {	\
		.clk_dev = DEVICE_DT_GET(STM32_CLOCK_CONTROL_NODE),			\
		.pclken = pclken_##n,							\
		.phy_pclken = phy_pclken_##n,						\
		.phy_pclken_len = DT_NUM_CLOCKS(UHC_DWC2_STM32U5_PHY_NODE(n)),		\
		.phy_ref_clk = UHC_DWC2_STM32U5_PHY_REF_CLK(n),				\
		.pcfg = UHC_DWC2_STM32U5_PCFG(n),					\
		.vbus_gpio = GPIO_DT_SPEC_INST_GET_OR(n, vbus_gpios, {0}),		\
		.force_vbus_valid = DT_INST_PROP(n, st_force_vbus_valid),			\
	};										\
											\
	static struct uhc_dwc2_stm32u5_data uhc_dwc2_quirk_data_##n;			\
											\
	static const struct uhc_dwc2_vendor_quirks uhc_dwc2_vendor_quirks_##n = {	\
		.pre_init = uhc_dwc2_stm32u5_pre_init,					\
		.pre_enable = uhc_dwc2_stm32u5_pre_enable,				\
		.post_enable = uhc_dwc2_stm32u5_post_enable,				\
		.disable = uhc_dwc2_stm32u5_disable,					\
		.shutdown = uhc_dwc2_stm32u5_shutdown,					\
	};

/* Define the quirks only for instances that use this compatible */
#define QUIRK_STM32U5_HSOTG_DEFINE_COMPAT(n)						\
	IF_ENABLED(DT_NODE_HAS_COMPAT(DT_DRV_INST(n), st_stm32u5_hsotg),		\
		   (QUIRK_STM32U5_HSOTG_DEFINE(n)))

DT_INST_FOREACH_STATUS_OKAY(QUIRK_STM32U5_HSOTG_DEFINE_COMPAT)

#endif /* ZEPHYR_DRIVERS_USB_UHC_DWC2_STM32U5_HSOTG_H */
